; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 191499 2 3 2 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	Star3 - direction
	Star0 - direction
	Star5 - direction
	GroundStation2 - direction
	Star1 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star5)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Star8 thermograph0)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Star11 thermograph0)
	(have_image Phenomenon12 spectrograph1)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 6
3. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
4. (turn_to satellite1 star11 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star11)
   goals met: 0 of 6
5. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 6
6. (turn_to satellite1 groundstation2 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 6
7. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   goals met: 1 of 6
8. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 1 of 6
9. (take_image satellite0 star8 instrument2 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 2 of 6
10. (turn_to satellite1 star11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star11)
   goals met: 2 of 6
11. (take_image satellite1 star11 instrument4 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 3 of 6
12. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 2 of 6
13. (take_image satellite0 star9 instrument2 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 3 of 6
14. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 3 of 6
15. (turn_to satellite1 star5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star5)
   goals met: 3 of 6
16. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 4 of 6
17. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 4 of 6
18. (turn_to satellite0 phenomenon10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 6
19. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 3 of 6
20. (turn_to satellite1 phenomenon12 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 6
21. (take_image satellite0 phenomenon10 instrument2 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 4 of 6
22. (turn_to satellite0 star8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star8)
   goals met: 5 of 6
23. (take_image satellite1 phenomenon12 instrument3 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 6 of 6
